pandas library

In [3]:
import pandas as pd

In [4]:
#creat table from pandas


# Create a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
# Read a CSV file into a DataFrame
df = pd.read_csv("./test.csv")
df

      name  age          city     phone
0    Alice   28      New York  555-1234
1      Bob   34   Los Angeles  555-5678
2  Charlie   22       Chicago  555-8765
3    David   30       Houston  555-4321
4      Eva   26       Phoenix  555-6789
5    Frank   40  Philadelphia  555-9876
6    Grace   29   San Antonio  555-3456
7   Hannah   31     San Diego  555-6543
8      Ian   27        Dallas  555-7890
9     Jane   35      San Jose  555-2109

In [9]:
#head of the table
df.head()

      name  age         city     phone
0    Alice   28     New York  555-1234
1      Bob   34  Los Angeles  555-5678
2  Charlie   22      Chicago  555-8765
3    David   30      Houston  555-4321
4      Eva   26      Phoenix  555-6789

In [10]:
# describe the data
df.describe()

             age
count  10.000000
mean   30.200000
std     5.116422
min    22.000000
25%    27.250000
50%    29.500000
75%    33.250000
max    40.000000

In [15]:
df

      name  age          city     phone
0    Alice   28      New York  555-1234
1      Bob   34   Los Angeles  555-5678
2  Charlie   22       Chicago  555-8765
3    David   30       Houston  555-4321
4      Eva   26       Phoenix  555-6789
5    Frank   40  Philadelphia  555-9876
6    Grace   29   San Antonio  555-3456
7   Hannah   31     San Diego  555-6543
8      Ian   27        Dallas  555-7890
9     Jane   35      San Jose  555-2109

In [ ]:
# Assuming you already did: df = pd.read_csv("people.csv")

# Use the exact column name
filtered_df = df[df['age'] > 30]
print(filtered_df)

     name  age          city     phone
1     Bob   34   Los Angeles  555-5678
5   Frank   40  Philadelphia  555-9876
7  Hannah   31     San Diego  555-6543
9    Jane   35      San Jose  555-2109

In [22]:
#sort the data
df_sorted = df.sort_values(by='age', ascending=False)
print(df_sorted)

      name  age          city     phone
5    Frank   40  Philadelphia  555-9876
9     Jane   35      San Jose  555-2109
1      Bob   34   Los Angeles  555-5678
7   Hannah   31     San Diego  555-6543
3    David   30       Houston  555-4321
6    Grace   29   San Antonio  555-3456
0    Alice   28      New York  555-1234
8      Ian   27        Dallas  555-7890
4      Eva   26       Phoenix  555-6789
2  Charlie   22       Chicago  555-8765